# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the bin/rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#Wars
post = Post.create([{ title: "Фикус Хенджин", description: "Недавно я приобрела небольшое деревце фикуса. Он достался мне 
от знакомой, которая занимается выращиванием растений. Надеюсь, 
с моими садоводческими навыками он не засохнет!", post_image: "" }, 
                    { title: "Росток Полина", description: "Наконец-то я смогла обменять росточек своей пальмы на маленький отросток монстеры. Уже жду его дальнейшего развития. Буду фиксировать все изменения 
                    в дневнике.", post_image: "" },
                    { title: "Ростки спатифиллума", description: "Мое взрослое растение спатифиллума совсем разрослось и начало засыхать( Зато удалось спасти несколько его росточков. Пишите, если кому-то хочется обменяться, с радостью рассмотрю ваши предложения)", post_image: "" },
                    { title: "Орхидея Виола", description: "Очень давно мечтала разнообразить свой комнатный сад цветами. На день рождения мне подарили вот такую белую красивую орхидею", post_image: "" },
                    { title: "Папоротник Чан", description: "Не планировала покупать новые растения, но в магазине не смогла пройти мимо такого нежного папоротника! Надеюсь, он разрастется до больших размеров", post_image: "" },
                    { title: "Антуриум Даша", description: "Моя мама недавно отдала мне листочки своего взрослого антуриума, ведь я давно хотела начать озеленять свою сухую квартиру. Ура! Я встала 
                    на верный путь", post_image: "" },
                    { title: "Гиацинт и Нарцисс", description: "Знакомая моей бабушки занимается разведением цветов. Она отдала мне вот такие прекрасные гиацинты 
                    и нарциссы. Теперь и на моем подоконнике есть немного цветов", post_image: "" },
                    { title: "Рассада клубники", description: "Дачный сезон уже закончился, а у меня  во всю зеленеет свежая рассада клубники! Будем радовать себя ягодами и осенью!", post_image: "" },
                    { title: "Замиокулькас Влад", description: "Переехали в новую квартиру, где появилось больше места для растений, теперь планируем озеленить наше жилище по максимуму", post_image: "" },
                    { title: "Дерево лимона", description: "Давно хотела вам рассказать, про свой опыт выращивания цитрусовых. У нас на балконе вырос настоящий желтый плод лимона! ", post_image: "" },
                    { title: "Ростки гороха", description: "Очень понравилось, как подружка выращивает горох на своем подоконникие. Решила тоже попробовать", post_image: "" },
                    { title: "Суккулент", description: "Никогда не могла пройти мимо таких милых миниатюрных кактусов. В моей коллекции кактусов еще одно пополнение!", post_image: "" },])
#   Character.create(name: "Luke", movie: movies.first)
